#include "serverconf.hpp"

const int SERVER_PORT = 54321;

// Причина ошибки - константа INADDER_LOOPBACK задает айпи адрес 127.0.0.1 в
// обратном порядке байт. Вот его десятичное представление - 2130706433
// функция inet_addr задает прямой порядок байт. В прямом наш localhost -
// 16777343. поэтому либо мы пишем ntohl(INADDER_LOOPBACK), переводя его из
// little endian в big endian (обратный в прямой); ntohl = Network to Host Long
// либо пишем inet_addr("127.0.0.1"); Потому что он оставляет прямой порядок
// байт.

// И еще, сокеты могут на сервере и клиенте иметь одинаковые номера, поскольку
// это разные процессы.
const struct sockaddr_in SERVER_ADDR = {
    AF_INET,
    htons(SERVER_PORT),
    // server_addr.sin_addr.s_addr = inet_addr("127.0.0.1");
    ntohl(INADDR_LOOPBACK),
    {0} // аттавизм, инициализирую нулями, проверь так ли инициализируем его
};
// Я решил конфигурировать addr внутри клиента и сервера

// По хорошему у сокета клиента третий параметр пишется таким: INADDR_LOOPBACK,
// чтобы посылать данные на внутренюю петлю. Так данные не попадут в сеть и
// будут двигаться в рамках одного пк. У сервера же, напротив, должна быть
// возмжность отправлять данные на любые адреса.
// Если поставить у него LOOPBACK, то подключения с других айпи работать не
// будут
// ИНтересно как подключить клиента на пк к серверу на ноуте.
// А вот INADDR_ANY посылает данные сразу на все сетевые интерфейсы, что может
// дать неопределенное поведение.

// Выбор между `INADDR_LOOPBACK` и `INADDR_ANY` влияет только на то, куда
// отправляются данные.